ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/ЖБИ_НормативныеДокументы/ЖБИ_НормативныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЖБИ_НормативныеДокументы</name>
  <comment>ЖБИ - Нормативные документы</comment>
</mdclass:Catalog>

ЖБИ_УТ11.РасширениеЖБИ/src/InformationRegisters/ЖБИ_НоменклатураПоставщиков/ЖБИ_НоменклатураПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖБИ_НоменклатураПоставщиков</name>
  <comment>ЖБИ - Номенклатура поставщиков</comment>
  <resources>
    <name>ПунктОтгрузки</name>
    <comment>Пункт отгрузки</comment>
    <type>
      <types>CatalogRef.ЖБИ_ПунктыНазначенияОтгрузки</types>
    </type>
  </resources>
  <resources>
    <name>СтатусОсторожно</name>
    <comment>Осторожно</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МаркировкаОбщепринятая</name>
    <comment>Маркировка общепринятая</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РасширенноеНаименование</name>
    <comment>Расширенное наименование</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормативныйДокумент</name>
    <comment>Норматив. документ</comment>
    <type>
      <types>CatalogRef.ЖБИ_НормативныеДокументы</types>
    </type>
  </resources>
  <resources>
    <name>НормаАвто</name>
    <comment>Норма погрузки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Качество</name>
    <comment>Качество</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <comment>Вес, т</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Объем м3</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <comment>Длина мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрММ</name>
    <comment>Диаметр мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтверстиеММ</name>
    <comment>Отверстие, мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрВх</name>
    <comment>Диаметр вх. мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДиаметрВых</name>
    <comment>Диаметр вых. мм</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>РабочаяДлина</name>
    <comment>Рабочая длин. мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолщинаСтенки</name>
    <comment>Толщина стенки мм.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Глубина</name>
    <comment>Глубина, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШиринаМакс</name>
    <comment>Шир. макс, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШиринаМин</name>
    <comment>Шир. мин, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВысотаМакс</name>
    <comment>Высота, макс, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВысотаМин</name>
    <comment>Высота, мин, мм</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Армирование</name>
    <comment>Армирование</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БетонВ</name>
    <comment>Бетон, В</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВодонепрW</name>
    <comment>Водонепр. W</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>МорозF</name>
    <comment>Мороз. F</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СертифицированДо</name>
    <comment>Сертифицирован до</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Негабаритный</name>
    <comment>Не габарит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КолВУпаковке</name>
    <comment>Кол-во в упаковке, шт</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесАвто</name>
    <comment>Вес в авто, т</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Направление</name>
    <comment>Направление</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <comment>Коментарий</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Мощность</name>
    <comment>Производственные мощности, шт./м2</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаПаузе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <comment>Дата обновления</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <comment>Поставщик</comment>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПоставщика</name>
    <comment>Номенклатура поставщика</comment>
    <type>
      <types>CatalogRef.НоменклатураПоставщиков</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖБИ_УТ11.РасширениеЖБИ/src/Catalogs/ЖБИ_НормативныеДокументы/ManagerModule.bsl
Функция ГостНоменклатурыПоставщика(НоменклатураПоставщика) Экспорт 
	
	Гост		= "";
	Поставщик 	= НоменклатураПоставщика.Владелец;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Поставщик",Поставщик);
	Запрос.УстановитьПараметр("НоменклатураПоставщика",НоменклатураПоставщика);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	                |	ЖБИ_НоменклатураПоставщиков.НормативныйДокумент КАК НормативныйДокумент
	                |ИЗ
	                |	РегистрСведений.ЖБИ_НоменклатураПоставщиков КАК ЖБИ_НоменклатураПоставщиков
	                |ГДЕ
					|	ЖБИ_НоменклатураПоставщиков.Партнер = &Поставщик
					|	И ЖБИ_НоменклатураПоставщиков.НоменклатураПоставщика = &НоменклатураПоставщика";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если РезультатЗапроса.Следующий() Тогда
		Гост = РезультатЗапроса.НормативныйДокумент;	
	КонецЕсли;
	
	Возврат Гост;
	
КонецФункции
